<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>

  <resources>
    <stringTable>
      <string id="Sup_BraveUpdate1_2_145_5">At least Google Update 1.2.145.5</string>
      <string id="Sup_BraveUpdate1_3_21_81">At least Google Update 1.3.21.81</string>
      <string id="Sup_BraveUpdate1_3_26_0">At least Google Update 1.3.26.0</string>
      <string id="Sup_BraveUpdate1_3_33_5">At least Google Update 1.3.33.5</string>
      <string id="Cat_BraveUpdate">Google Update</string>
      <string id="Cat_Preferences">Preferences</string>
      <string id="Cat_ProxyServer">Proxy Server</string>
      <string id="Cat_Applications">Applications</string>
      <string id="Pol_AutoUpdateCheckPeriod">Auto-update check period override</string>
      <string id="Pol_UpdateCheckSuppressedPeriod">Time period in each day to suppress auto-update check</string>
      <string id="Pol_DownloadPreference">Download URL class override</string>
      <string id="DownloadPreference_DropDown">Cacheable download URLs</string>
      <string id="Pol_ProxyMode">Choose how to specify proxy server settings</string>
      <string id="Pol_ProxyServer">Address or URL of proxy server</string>
      <string id="Pol_ProxyPacUrl">URL to a proxy .pac file</string>
      <string id="Pol_DefaultAllowInstallation">Allow installation default</string>
      <string id="Pol_AllowInstallation">Allow installation</string>
      <string id="Pol_DefaultUpdatePolicy">Update policy override default</string>
      <string id="Pol_UpdatePolicy">Update policy override</string>
      <string id="Pol_TargetVersionPrefix">Target version prefix override</string>
      <string id="Part_AutoUpdateCheckPeriod">Minutes between update checks</string>
      <string id="Part_UpdateCheckSuppressedStartHour">Hour in a day that start to suppress update check</string>
      <string id="Part_UpdateCheckSuppressedStartMin">Minute in hour that starts to suppress update check</string>
      <string id="Part_UpdateCheckSuppressedDurationMin">Number of minutes to suppress update check each day</string>
      <string id="Part_ProxyMode">Choose how to specify proxy server settings</string>
      <string id="Part_ProxyServer">Address or URL of proxy server</string>
      <string id="Part_ProxyPacUrl">URL to a proxy .pac file</string>
      <string id="Part_UpdatePolicy">Policy</string>
      <string id="Part_TargetVersionPrefix">Target version prefix</string>
      <string id="Name_UpdatesEnabled">Always allow updates (recommended)</string>
      <string id="Name_ManualUpdatesOnly">Manual updates only</string>
      <string id="Name_AutomaticUpdatesOnly">Automatic silent updates only</string>
      <string id="Name_UpdatesDisabled">Updates disabled</string>
      <string id="ProxyDisabled_DropDown">Never use a proxy</string>
      <string id="ProxyAutoDetect_DropDown">Auto detect proxy settings</string>
      <string id="ProxyPacScript_DropDown">Use a .pac proxy script</string>
      <string id="ProxyFixedServers_DropDown">Use fixed proxy servers</string>
      <string id="ProxyUseSystem_DropDown">Use system proxy settings</string>
      <string id="Explain_BraveUpdate">Policies to control the installation and updating of Google applications that use Google Update/Google Installer.</string>
      <string id="Explain_Preferences">General policies for Google Update.</string>
      <string id="Explain_AutoUpdateCheckPeriod">Minimum number of minutes between automatic update checks.

Set the value to 0 if you want to disable all auto-update checks (not recommended).</string>
      <string id="Explain_DownloadPreference">If enabled, the Google Update server will attempt to provide cache-friendly URLs for update payloads in its responses.</string>
      <string id="Explain_UpdateCheckSuppressedPeriod">If this setting is enabled, update checks will be suppressed during each day starting from Hour:Minute for a period of Duration (in minutes). Duration does not account for daylight savings time. So for instance, if the start time is 22:00, and with a duration of 480 minutes, the updates will be suppressed for 8 hours regardless of whether daylight savings time changes happen in between.</string>
      <string id="Explain_ProxyMode">Allows you to specify the proxy server used by Google Update.

If you choose to never use a proxy server and always connect directly, all other options are ignored.

If you choose to use system proxy settings or auto detect the proxy server, all other options are ignored.

If you choose fixed server proxy mode, you can specify further options in 'Address or URL of proxy server'.

If you choose to use a .pac proxy script, you must specify the URL to the script in 'URL to a proxy .pac file'.</string>
      <string id="Explain_ProxyServer">You can specify the URL of the proxy server here.

This policy only takes effect if you have selected manual proxy settings at 'Choose how to specify proxy server settings'.</string>
      <string id="Explain_ProxyPacUrl">You can specify a URL to a proxy .pac file here.

This policy only takes effect if you have selected manual proxy settings at 'Choose how to specify proxy server settings'.</string>
      <string id="Explain_Applications">Policies for individual applications.

An updated ADMX/ADML template will be required to support Google applications released in the future.</string>
      <string id="Explain_DefaultAllowInstallation">Specifies the default behavior for whether Google software can be installed using Google Update/Google Installer.

Can be overridden by the "Allow installation" for individual applications.

Only affects installation of Google software using Google Update/Google Installer. Cannot prevent running the application installer directly or installation of Google software that does not use Google Update/Google Installer for installation.</string>
      <string id="Explain_DefaultUpdatePolicy">Specifies the default policy for software updates from Google.

Can be overridden by the "Update policy override" for individual applications.

Options:
 - Always allow updates: Updates are always applied when found, either by periodic update check or by a manual update check.
 - Manual updates only: Updates are only applied when the user does a manual update check. (Not all apps provide an interface for this.)
 - Automatic silent updates only: Updates are only applied when they are found via the periodic update check.
 - Updates disabled: Never apply updates.

If you select manual updates, you should periodically check for updates using each application's manual update mechanism if available. If you disable updates, you should periodically check for updates and distribute them to users.

Only affects updates for Google software that uses Google Update for updates. Does not prevent auto-updates of Google software that does not use Google Update for updates.

Updates for Google Update are not affected by this setting; Google Update will continue to update itself while it is installed.

WARNING: Disabing updates will also prevent updates of any new Google applications released in the future, possibly including dependencies for future versions of installed applications.</string>
      <string id="Cat_GoogleTestFoo">Google Test Foo</string>
      <string id="Explain_InstallGoogleTestFoo">Specifies whether Google Test Foo can be installed using Google Update/Google Installer.

If this policy is not configured, Google Test Foo can be installed as specified by "Allow installation default".</string>
      <string id="Explain_AutoUpdateGoogleTestFoo">Specifies how Google Update handles available Google Test Foo updates from Google.

If this policy is not configured, Google Update handles available updates as specified by "Update policy override default".

Options:
 - Always allow updates: Updates are always applied when found, either by periodic update check or by a manual update check.
 - Manual updates only: Updates are only applied when the user does a manual update check. (Not all apps provide an interface  for this.)
 - Automatic silent updates only: Updates are only applied when they are found via the periodic update check.
 - Updates disabled: Never apply updates.

If you select manual updates, you should periodically check for updates using the application's manual update mechanism if available. If you disable updates, you should periodically check for updates and distribute them to users. Check http://www.google.com/test_foo/.</string>
      <string id="Explain_TargetVersionPrefixGoogleTestFoo">Specifies which version Google Test Foo should be updated to.

When this policy is enabled, the app will be updated to the version prefixed with this policy value.

Some examples:
1) Not configured: app will be update to latest version available.
2) Policy value is set to "55.", the app will be updated to any minor version of 55 (e.g. 55.24.34 or 55.60.2).
3) Policy value is "55.2.", the app will be updated to any minor version of 55.2 (e.g. 55.2.34 or 55.2.2).
4) Policy value is "55.24.34", the app will be updated to this specific version only.</string>
      <string id="Cat_GoogleUserTestFoo">Google User Test Foo©®™</string>
      <string id="Explain_InstallGoogleUserTestFoo">Specifies whether Google User Test Foo©®™ can be installed using Google Update/Google Installer.

If this policy is not configured, Google User Test Foo©®™ can be installed as specified by "Allow installation default".</string>
      <string id="Explain_AutoUpdateGoogleUserTestFoo">Specifies how Google Update handles available Google User Test Foo©®™ updates from Google.

If this policy is not configured, Google Update handles available updates as specified by "Update policy override default".

Options:
 - Always allow updates: Updates are always applied when found, either by periodic update check or by a manual update check.
 - Manual updates only: Updates are only applied when the user does a manual update check. (Not all apps provide an interface  for this.)
 - Automatic silent updates only: Updates are only applied when they are found via the periodic update check.
 - Updates disabled: Never apply updates.

If you select manual updates, you should periodically check for updates using the application's manual update mechanism if available. If you disable updates, you should periodically check for updates and distribute them to users. Check http://www.google.com/user_test_foo/.</string>
      <string id="Explain_TargetVersionPrefixGoogleUserTestFoo">Specifies which version Google User Test Foo©®™ should be updated to.

When this policy is enabled, the app will be updated to the version prefixed with this policy value.

Some examples:
1) Not configured: app will be update to latest version available.
2) Policy value is set to "55.", the app will be updated to any minor version of 55 (e.g. 55.24.34 or 55.60.2).
3) Policy value is "55.2.", the app will be updated to any minor version of 55.2 (e.g. 55.2.34 or 55.2.2).
4) Policy value is "55.24.34", the app will be updated to this specific version only.</string>
    </stringTable>
    <presentationTable>
      <presentation id="Pol_AutoUpdateCheckPeriod">
        <decimalTextBox refId="Part_AutoUpdateCheckPeriod" defaultValue="1400"
            spinStep="60">Minutes between update checks</decimalTextBox>
      </presentation>
      <presentation id="Pol_UpdateCheckSuppressedPeriod">
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartHour"
            defaultValue="0" spinStep="1">Hour</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartMin"
            defaultValue="0" spinStep="1">Minute</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedDurationMin"
            defaultValue="60">Duration</decimalTextBox>
      </presentation>
      <presentation id="Pol_DownloadPreference">
        <dropdownList refId="Part_DownloadPreference"
            defaultItem="0">Type of download URL to request</dropdownList>
      </presentation>
      <presentation id="Pol_ProxyMode">
        <dropdownList refId="Part_ProxyMode"
            defaultItem="0">Choose how to specify proxy server settings
        </dropdownList>
      </presentation>
      <presentation id="Pol_ProxyServer">
        <textBox refId="Part_ProxyServer">
          <label>Address or URL of proxy server</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ProxyPacUrl">
        <textBox refId="Part_ProxyPacUrl">
          <label>URL to a proxy .pac file</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_DefaultAllowInstallation" />
      <presentation id="Pol_DefaultUpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Policy</dropdownList>
      </presentation>
      <presentation id="Pol_AllowInstallation" />
      <presentation id="Pol_UpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Policy</dropdownList>
      </presentation>      <presentation id="Pol_TargetVersionPrefix">
        <textBox refId="Part_TargetVersionPrefix">
          <label>Target version prefix</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>

    </presentationTable>
  </resources>
</policyDefinitionResources>